app/controllers/items_controller.rb

  def create
  	# raise params.inspect
	@list = List.find(params[:list_id])
  # @items = @list.items.new unless @items.blank?
	@item = @list.items.build(item_params)
  	# @item = Item.new(item_params)
  	if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "onions"], ["list_id", 1], ["created_at", "2016-07-16 20:29:35.312895"], ["updated_at", "2016-07-16 20:29:35.312895"]]

    def update
      # raise params.inspect
      @item = Item.find(params[:id])
      @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 0], ["updated_at", "2016-07-17 22:06:57.350543"], ["id", 1]]