app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.new
    @lists = List.all

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "A new list"], ["created_at", "2016-07-15 17:36:44.392993"], ["updated_at", "2016-07-15 17:36:44.392993"]]
SELECT "lists".* FROM "lists"
---
  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to list_url(@list)
    else
      @lists = List.all